import pandas as pd

# 创建包含数据的字典
data = {
    'prob': [0.000000, 0.050000, 0.100000, 0.150000, 0.200000, 0.250000, 0.300000, 0.350000, 0.400000, 0.450000, 0.500000, 0.550000, 0.600000, 0.650000, 0.700000, 0.750000, 0.800000, 0.850000, 0.900000, 0.950000, 1.000000],
    'accuracy': [0.980500, 0.970600, 0.949200, 0.948100, 0.961800, 0.917900, 0.961200, 0.964700, 0.966000, 0.967500, 0.962700, 0.968400, 0.968900, 0.973200, 0.975500, 0.978200, 0.977800, 0.975600, 0.979200, 0.980700, 0.980600]
}

# 创建DataFrame
df = pd.DataFrame(data)

# 将DataFrame转置（行变成列，列变成行）
df = df.T

# 将DataFrame写入Excel文件
excel_file = "Kernelaccuracy_data.xlsx"
df.to_excel(excel_file, index=False, header=False)  # 不写入行和列的索引，不写入列名

print(f"Data has been written to {excel_file}")
